# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CitySet..::..Erase Method
CitySet Class See Also
---
Removes a specified city from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	City item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As City _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	City^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CityThe city to be erased.
# ### Return Value
The number of cities that were erased from the set.
# See Also
CitySet Class
Autodesk.Revit.DB Namespace